// About the project text generator
const textsList = [
  {
    text: "როცა წიგნი გვახსენდება, ქაღალდის ფურცელზე დაბეჭდილი ობიექტი წარმოგვიდგება, მაგარ ან რბილ ყდაში აკინძული. ეს ჩვენი წარმოდგენა დღეს შეიძლება საერთოდ აღარ შეესაბამებოდეს რეალობას. დღეს წიგნს ხშირად ფაილის სახე აქვს. ასეთ წიგნს საერთოდ არ გააჩნია მატერიალური გარსი. ის მხოლოდ კომპიუტერულ მოწყობილობაში ჩაწერილი ბინარული მონაცემების სახით არსებობს. მისი ფორმა იმ მოწყობილობით არის განპირობებული, რომელშიც თავად წიგნია ჩატვირთული.",
  },
  {
    text: "კაცობრიობის განვითარების სხვადასხვა პერიოდში წიგნს განსხვავებული სახით გამოსცემდნენ. უძველესი შუმერული წიგნები თიხის ფირფიტებისა იყო. ჩვენი გადმოსახედიდან, ისინი აგურებს უფრო ჰგვანან ვიდრე წიგნებს. ეგვიპტელები წიგნებს პაპირუსზე წერდნენ, მასალიდან გამომდინარე, ასეთ წიგნებს გრძელი გრაგნილების სახე ჰქონდათ. შუასაუკუნეების ხელნაწერი წიგნები, ფოლიანტები, ძალიან დიდი ზომისა იყო. ასეთ წიგნთან ერთად შენს ოთახში ვერ განმარტოვდებოდი, ასეთ წიგნს მუხლებზე ვერ დაიდებდი, მათ სპეციალურად მოწყობილ მაგიდებზე დებდნენ და ისე კითხულობდნენ.",
  },
  {
    text: "წიგნის გარეგანი ფორმის ცვლილებასთან ერთად იცვლებოდა წიგნის ავტორი, მისი გამომცემელი და წიგნის მკითხველი. იცვლებოდა თავად ამბავიც რომელსაც წიგნი ყვება. არ იცვლება ის უსაზღვრო შესაძლებლობები რომელსაც წიგნი გვაძლევს. ვიმოგზაუროთ იქ სადაც არ ვყოფილვართ, გავხდეთ თანაზიარი იმ ამბებისა რომელიც ჩვენ არ გადაგვხდენია თავს. გავიზიაროთ აზრები რომელსაც ავტორი გვთავაზობს.",
  },
  {
    text: "ეს წიგნი, წიგნის ინტერნეტ გამოცემაა. ამ წიგნით მოყოლილი ამბები ტექნოლოგიებსა და თანამედროვე ადამიანის მაგიურ შესაძლებლობებზეა. ამ წიგნის ქაღალდზე დაბეჭდილი ვერსია არ არსებობს, წიგნში მოთხრობილი ამბების წაკითხვა, მოსმენა მხოლოდ ტექნოლოგიების წყალობით არის შესაძლებელი.",
  }
]

const aboutTexts = document.querySelector('.about-texts');
let aboutTextContent = '';
textsList.forEach(currentValue => {
  aboutTextContent += `<p class="about-text"> ${currentValue.text} </p>`;
})
aboutTexts.innerHTML = aboutTextContent;